In [160]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from scipy import interpolate
from scipy.interpolate import InterpolatedUnivariateSpline

In [161]:
household_prices_without_VAT = pd.read_excel(r'/Users/shakhawathossainturag/Downloads/Energiepreisentwicklung.xlsx',sheet_name='5.8.2 Strom - â‚¬ - Haushalte', skiprows = 5, nrows = 26, index_col = 0)
household_prices_without_VAT = household_prices_without_VAT.iloc[:,0]
#household_prices_without_VAT.columns = ["year","price"]
household_prices_without_VAT = household_prices_without_VAT.reset_index()
household_prices_without_VAT.head()

        index  Unnamed: 1
0  1. HJ 2008       21.48
1  2. HJ 2008       21.95
2  1. HJ 2009       22.82
3  2. HJ 2009       22.94
4  1. HJ 2010       23.75

In [162]:

household_prices_without_VAT["index"]= household_prices_without_VAT["index"].str.slice(start = 5)
household_prices_without_VAT.columns = ["year","price"]

In [163]:
household_prices_without_VAT.head(5)

    year  price
0   2008  21.48
1   2008  21.95
2   2009  22.82
3   2009  22.94
4   2010  23.75

In [164]:
household_prices_without_VAT = household_prices_without_VAT.set_index("year")

household_prices_without_VAT.index = household_prices_without_VAT.index.astype(str)
household_prices_without_VAT.index =  pd.to_datetime(household_prices_without_VAT.index, errors='ignore')
household_prices_without_VAT = household_prices_without_VAT.astype(float)
household_prices_without_VAT = household_prices_without_VAT.resample('12M').mean()
household_prices_without_VAT.index = household_prices_without_VAT.index.astype(str)
household_prices_without_VAT

             price
year
2008-01-31  21.715
2009-01-31  22.880
2010-01-31  24.065
2011-01-31  25.295
2012-01-31  26.355
2013-01-31  29.200
2014-01-31  29.775
2015-01-31  29.485
2016-01-31  29.730
2017-01-31  30.480
2018-01-31  29.935
2019-01-31  29.830
2020-01-31  30.245

In [165]:
household_prices_without_VAT.index= household_prices_without_VAT.index.str.slice(start = 0, stop = -6)
household_prices_without_VAT

       price
year
2008  21.715
2009  22.880
2010  24.065
2011  25.295
2012  26.355
2013  29.200
2014  29.775
2015  29.485
2016  29.730
2017  30.480
2018  29.935
2019  29.830
2020  30.245

In [166]:
household_prices_without_VAT

       price
year
2008  21.715
2009  22.880
2010  24.065
2011  25.295
2012  26.355
2013  29.200
2014  29.775
2015  29.485
2016  29.730
2017  30.480
2018  29.935
2019  29.830
2020  30.245